liamsabs/ECE499-buoyancy-energy-storage-system/ece499-dspic33ck/hall-sensor-based-foc-dspic33ck256mp508-lvmc/pmsm.c
        MC_CalculateSpaceVectorPhaseShifted_Assembly(&vabc,pwmPeriod,
                                                    &pwmDutycycle);
        PWMDutyCycleSet(&pwmDutycycle);            
    }
  
    else
    {
        INVERTERA_PWM_TRIGA = ADC_SAMPLING_POINT;
        pwmDutycycle.dutycycle3 = MIN_DUTY;
        pwmDutycycle.dutycycle2 = MIN_DUTY;
        pwmDutycycle.dutycycle1 = MIN_DUTY;
        PWMDutyCycleSet(&pwmDutycycle);
    } 
    if (uGF.bits.MotorState == 0)
    {
        measureInputs.current.Ia = ADCBUF_INV_A_IPHASE1;
        measureInputs.current.Ib = ADCBUF_INV_A_IPHASE2; 
        measureInputs.current.Ibus = ADCBUF_INV_A_IBUS; 
    }
   
    //If the offset value wasn't recently updated we measure it.
    if (MCAPP_MeasureCurrentOffsetStatus(&measureInputs) == 0)
    {
       //
        MCAPP_MeasureCurrentOffset(&measureInputs);
    }
    else
    {
        //Increments number of times it's entered ISR, don't know why we only do this sometimes
        BoardServiceStepIsr(); 
    }
    
    //Need to change the potvalue, this will instead be controlled by spi inputs
    measureInputs.potValue = (int16_t)( ADCBUF_SPEED_REF_A>>1);
    
    
    measureInputs.dcBusVoltage = (int16_t)( ADCBUF_VBUS_A>>1);

    //Measuring temp is good for errors
    MCAPP_MeasureTemperature(&measureInputs,(int16_t)(ADCBUF_MOSFET_TEMP_A>>1));

    //Update X2C scope
    DiagnosticsStepIsr();
    /* Read ADC Buffet to Clear Flag */
	adcDataBuffer = ClearADCIF_ReadADCBUF();
    ClearADCIF();   
}

void __attribute__((interrupt, no_auto_psv)) _SPI1Interrupt(void)
{
    // Check if SPI receive buffer is full
    if (SPI1STATLbits.SPIRBF) {
        
        uint8_t rxBuffer = SPI1BUFL;  // Read received data
        
        /* Processing Commands */
        if (rxBuffer == 0x01) { // store command
            
            /* State Processing Logic */
            if (system.state == IDLE || system.state == GENERATING) {
                
                system.state = STORING; // set state to storing 
                
                /* Begin Motor Spinning */
                ResetParmeters();
                uGF.bits.MotorState = 0b01;
                EnablePWMOutputsInverterAMotor();
                
            } else if (system.state == PAUSED) {
                
                if (system.unpausedState == IDLE || system.unpausedState == STORING || system.unpausedState == GENERATING) {
                    
                    system.state = STORING; // set state to storing 

                    /* Begin Motor Spinning */
                    ResetParmeters();
                    uGF.bits.MotorState = 0b01;
                    EnablePWMOutputsInverterAMotor();
                    if (system.unpausedState != IDLE) {
                        /* TODO: Unlock System */
                    }
                
                } else if (system.unpausedState == STORED) {
                    system.state = STORED; // Motor has no place to go, set back to stored
                }
            } 
               
        } else if (rxBuffer == 0x02) { // generate 
            
            /* State Processing Logic */
            if (system.state == STORING || system.state == STORED) {
                
                system.state = GENERATING; // set state to generating 
                
                /* Begin Motor Spinning */
                ResetParmeters();
                uGF.bits.MotorState = 0b10;
                EnablePWMOutputsInverterAGenerator();
                
            } else if (system.state == PAUSED) {
                
                if (system.unpausedState == IDLE) {
                    
                    system.state = IDLE;
                    
                } else {
                    system.state = GENERATING; // set state to generating 

                    /* Begin Motor Spinning */
                    ResetParmeters();
                    uGF.bits.MotorState = 0b10;
                    EnablePWMOutputsInverterAGenerator();
                }         
            }   
            
        } else if (rxBuffer == 0x03) { // pause
            
            /* State Processing Logic */
            if (system.state != PAUSED) { // if IDLE or STORED, simply store state and pause
                
                if (system.state == STORING || system.state == GENERATING) {
                    ResetParmeters(); // Stop the motor, reset motor parameters
                    /* TODO: Engage Locking Mechanism */
                }
                system.unpausedState = system.state;
                system.state = PAUSED; 
                 
            } else {
                if (system.unpausedState == STORING) {
                    
                    system.state = STORING; // set back to storing
                    
                    /* Begin Motor Spinning */
                    ResetParmeters();
                    uGF.bits.MotorState = 0b01;
                    EnablePWMOutputsInverterAMotor();
                    /* TODO: Unlock mechanism */
                    
                } else if (system.unpausedState == GENERATING) {
                    
                    system.state = GENERATING; // set back to generating
                    
                    /* Begin Motor Spinning */
                    ResetParmeters();
                    uGF.bits.MotorState = 0b10;
                    EnablePWMOutputsInverterAGenerator();
                    /* TODO: Unlock mechanism */
                } else {
                    system.state = system.unpausedState;
                }
            }   
        } else if (rxBuffer == 0x04) { // sensor data request
            for (int i = 0; i < SPI_TX_BUFFER_SIZE; i++) {
                /* Logic for Sending Each Byte */
                SPI1BUFL = txBuffer[i];  // Transmit each byte
                while (SPI1STATLbits.SPITBF);  // Wait for transmit buffer to be empty
                IFS0bits.SPI1TXIF = 0;  // Clear SPI1 transmit interrupt flag
            }
        }   
    }
    
    // Clear SPI interrupt flag
    IFS7bits.SPI1IF = 0;    // Clear SPI1 interrupt flag
}


// *****************************************************************************
/* Function:
    CalculateParkAngle ()

  Summary:
    Function calculates the angle for open loop control

  Description:
    Generate the start sine waves feeding the motor terminals
    Open loop control, forcing the motor to align and to start speeding up .
 
  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

